{"config": {"name": "model_8", "output_layers": [["conv2d_11", 0, 0]], "input_layers": [["input_9", 0, 0]], "layers": [{"name": "input_9", "config": {"name": "input_9", "dtype": "float32", "batch_input_shape": [null, 32], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dense_3", "config": {"bias_regularizer": null, "units": 64, "name": "dense_3", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "reshape_2", "config": {"name": "reshape_2", "trainable": true, "target_shape": [4, 4, 4]}, "class_name": "Reshape", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"filters": 4, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_8", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "config": {"name": "up_sampling2d_4", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"filters": 8, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_9", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"name": "up_sampling2d_5", "config": {"name": "up_sampling2d_5", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"filters": 16, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_10", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"name": "up_sampling2d_6", "config": {"name": "up_sampling2d_6", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"filters": 1, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_11", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "sigmoid"}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.8"}